Revit 2027 API
Space.Occupiable Property
Reports whether this zone is Occupiable or not.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Occupiable { get; }
Public ReadOnly Property Occupiable As Boolean
	Get
public:
property bool Occupiable {
	bool get ();
}
member Occupiable : bool with get
Property Value
Boolean
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace